#ifndef __GYRO_H
#define __GYRO_H
#include "sys.h"
//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//ALIENTEK STM32开发板
//定时器 驱动代码	   
//正点原子@ALIENTEK
//技术论坛:www.openedv.com
//创建日期:2016/7/11
//版本：V1.1
//版权所有，盗版必究。
//Copyright(C) 广州市星翼电子科技有限公司 2014-2024
//All rights reserved					
//********************************************************************************
//修改说明
//V1.1 20160711
//新增TIM3_PWM_Init函数,用于PWM输出							  
////////////////////////////////////////////////////////////////////////////////// 	 

//通过改变TIM3->CCR4的值来改变占空比，从而控制LED0的亮度
#define gyrol TIM3->CCR1    
#define gyror TIM3->CCR2

void TIM3_Int_Init(u16 arr,u16 psc);
void TIM3_PWM_Init(u32 arr,u32 psc);
#endif
